{"weightsManifest": [{"weights": [{"shape": [3, 3, 3, 32], "name": "conv1/kernel", "dtype": "float32"}, {"shape": [32], "name": "conv1_bn/gamma", "dtype": "float32"}, {"shape": [32], "name": "conv1_bn/beta", "dtype": "float32"}, {"shape": [32], "name": "conv1_bn/moving_mean", "dtype": "float32"}, {"shape": [32], "name": "conv1_bn/moving_variance", "dtype": "float32"}, {"shape": [3, 3, 32, 1], "name": "conv_dw_1/depthwise_kernel", "dtype": "float32"}, {"shape": [3, 3, 512, 1], "name": "conv_dw_10/depthwise_kernel", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_10_bn/gamma", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_10_bn/beta", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_10_bn/moving_mean", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_10_bn/moving_variance", "dtype": "float32"}, {"shape": [3, 3, 512, 1], "name": "conv_dw_11/depthwise_kernel", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_11_bn/gamma", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_11_bn/beta", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_11_bn/moving_mean", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_11_bn/moving_variance", "dtype": "float32"}, {"shape": [3, 3, 512, 1], "name": "conv_dw_12/depthwise_kernel", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_12_bn/gamma", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_12_bn/beta", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_12_bn/moving_mean", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_12_bn/moving_variance", "dtype": "float32"}, {"shape": [3, 3, 1024, 1], "name": "conv_dw_13/depthwise_kernel", "dtype": "float32"}, {"shape": [1024], "name": "conv_dw_13_bn/gamma", "dtype": "float32"}, {"shape": [1024], "name": "conv_dw_13_bn/beta", "dtype": "float32"}, {"shape": [1024], "name": "conv_dw_13_bn/moving_mean", "dtype": "float32"}, {"shape": [1024], "name": "conv_dw_13_bn/moving_variance", "dtype": "float32"}, {"shape": [32], "name": "conv_dw_1_bn/gamma", "dtype": "float32"}, {"shape": [32], "name": "conv_dw_1_bn/beta", "dtype": "float32"}, {"shape": [32], "name": "conv_dw_1_bn/moving_mean", "dtype": "float32"}, {"shape": [32], "name": "conv_dw_1_bn/moving_variance", "dtype": "float32"}, {"shape": [3, 3, 64, 1], "name": "conv_dw_2/depthwise_kernel", "dtype": "float32"}, {"shape": [64], "name": "conv_dw_2_bn/gamma", "dtype": "float32"}, {"shape": [64], "name": "conv_dw_2_bn/beta", "dtype": "float32"}, {"shape": [64], "name": "conv_dw_2_bn/moving_mean", "dtype": "float32"}, {"shape": [64], "name": "conv_dw_2_bn/moving_variance", "dtype": "float32"}, {"shape": [3, 3, 128, 1], "name": "conv_dw_3/depthwise_kernel", "dtype": "float32"}, {"shape": [128], "name": "conv_dw_3_bn/gamma", "dtype": "float32"}, {"shape": [128], "name": "conv_dw_3_bn/beta", "dtype": "float32"}, {"shape": [128], "name": "conv_dw_3_bn/moving_mean", "dtype": "float32"}, {"shape": [128], "name": "conv_dw_3_bn/moving_variance", "dtype": "float32"}, {"shape": [3, 3, 128, 1], "name": "conv_dw_4/depthwise_kernel", "dtype": "float32"}, {"shape": [128], "name": "conv_dw_4_bn/gamma", "dtype": "float32"}, {"shape": [128], "name": "conv_dw_4_bn/beta", "dtype": "float32"}, {"shape": [128], "name": "conv_dw_4_bn/moving_mean", "dtype": "float32"}, {"shape": [128], "name": "conv_dw_4_bn/moving_variance", "dtype": "float32"}, {"shape": [3, 3, 256, 1], "name": "conv_dw_5/depthwise_kernel", "dtype": "float32"}, {"shape": [256], "name": "conv_dw_5_bn/gamma", "dtype": "float32"}, {"shape": [256], "name": "conv_dw_5_bn/beta", "dtype": "float32"}, {"shape": [256], "name": "conv_dw_5_bn/moving_mean", "dtype": "float32"}, {"shape": [256], "name": "conv_dw_5_bn/moving_variance", "dtype": "float32"}, {"shape": [3, 3, 256, 1], "name": "conv_dw_6/depthwise_kernel", "dtype": "float32"}, {"shape": [256], "name": "conv_dw_6_bn/gamma", "dtype": "float32"}, {"shape": [256], "name": "conv_dw_6_bn/beta", "dtype": "float32"}, {"shape": [256], "name": "conv_dw_6_bn/moving_mean", "dtype": "float32"}, {"shape": [256], "name": "conv_dw_6_bn/moving_variance", "dtype": "float32"}, {"shape": [3, 3, 512, 1], "name": "conv_dw_7/depthwise_kernel", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_7_bn/gamma", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_7_bn/beta", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_7_bn/moving_mean", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_7_bn/moving_variance", "dtype": "float32"}, {"shape": [3, 3, 512, 1], "name": "conv_dw_8/depthwise_kernel", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_8_bn/gamma", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_8_bn/beta", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_8_bn/moving_mean", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_8_bn/moving_variance", "dtype": "float32"}, {"shape": [3, 3, 512, 1], "name": "conv_dw_9/depthwise_kernel", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_9_bn/gamma", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_9_bn/beta", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_9_bn/moving_mean", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_9_bn/moving_variance", "dtype": "float32"}, {"shape": [1, 1, 1024, 3036], "name": "conv_preds/kernel", "dtype": "float32"}, {"shape": [3036], "name": "conv_preds/bias", "dtype": "float32"}, {"shape": [1, 1, 32, 64], "name": "conv_pw_1/kernel", "dtype": "float32"}, {"shape": [1, 1, 512, 512], "name": "conv_pw_10/kernel", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_10_bn/gamma", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_10_bn/beta", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_10_bn/moving_mean", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_10_bn/moving_variance", "dtype": "float32"}, {"shape": [1, 1, 512, 512], "name": "conv_pw_11/kernel", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_11_bn/gamma", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_11_bn/beta", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_11_bn/moving_mean", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_11_bn/moving_variance", "dtype": "float32"}, {"shape": [1, 1, 512, 1024], "name": "conv_pw_12/kernel", "dtype": "float32"}, {"shape": [1024], "name": "conv_pw_12_bn/gamma", "dtype": "float32"}, {"shape": [1024], "name": "conv_pw_12_bn/beta", "dtype": "float32"}, {"shape": [1024], "name": "conv_pw_12_bn/moving_mean", "dtype": "float32"}, {"shape": [1024], "name": "conv_pw_12_bn/moving_variance", "dtype": "float32"}, {"shape": [1, 1, 1024, 1024], "name": "conv_pw_13/kernel", "dtype": "float32"}, {"shape": [1024], "name": "conv_pw_13_bn/gamma", "dtype": "float32"}, {"shape": [1024], "name": "conv_pw_13_bn/beta", "dtype": "float32"}, {"shape": [1024], "name": "conv_pw_13_bn/moving_mean", "dtype": "float32"}, {"shape": [1024], "name": "conv_pw_13_bn/moving_variance", "dtype": "float32"}, {"shape": [64], "name": "conv_pw_1_bn/gamma", "dtype": "float32"}, {"shape": [64], "name": "conv_pw_1_bn/beta", "dtype": "float32"}, {"shape": [64], "name": "conv_pw_1_bn/moving_mean", "dtype": "float32"}, {"shape": [64], "name": "conv_pw_1_bn/moving_variance", "dtype": "float32"}, {"shape": [1, 1, 64, 128], "name": "conv_pw_2/kernel", "dtype": "float32"}, {"shape": [128], "name": "conv_pw_2_bn/gamma", "dtype": "float32"}, {"shape": [128], "name": "conv_pw_2_bn/beta", "dtype": "float32"}, {"shape": [128], "name": "conv_pw_2_bn/moving_mean", "dtype": "float32"}, {"shape": [128], "name": "conv_pw_2_bn/moving_variance", "dtype": "float32"}, {"shape": [1, 1, 128, 128], "name": "conv_pw_3/kernel", "dtype": "float32"}, {"shape": [128], "name": "conv_pw_3_bn/gamma", "dtype": "float32"}, {"shape": [128], "name": "conv_pw_3_bn/beta", "dtype": "float32"}, {"shape": [128], "name": "conv_pw_3_bn/moving_mean", "dtype": "float32"}, {"shape": [128], "name": "conv_pw_3_bn/moving_variance", "dtype": "float32"}, {"shape": [1, 1, 128, 256], "name": "conv_pw_4/kernel", "dtype": "float32"}, {"shape": [256], "name": "conv_pw_4_bn/gamma", "dtype": "float32"}, {"shape": [256], "name": "conv_pw_4_bn/beta", "dtype": "float32"}, {"shape": [256], "name": "conv_pw_4_bn/moving_mean", "dtype": "float32"}, {"shape": [256], "name": "conv_pw_4_bn/moving_variance", "dtype": "float32"}, {"shape": [1, 1, 256, 256], "name": "conv_pw_5/kernel", "dtype": "float32"}, {"shape": [256], "name": "conv_pw_5_bn/gamma", "dtype": "float32"}, {"shape": [256], "name": "conv_pw_5_bn/beta", "dtype": "float32"}, {"shape": [256], "name": "conv_pw_5_bn/moving_mean", "dtype": "float32"}, {"shape": [256], "name": "conv_pw_5_bn/moving_variance", "dtype": "float32"}, {"shape": [1, 1, 256, 512], "name": "conv_pw_6/kernel", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_6_bn/gamma", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_6_bn/beta", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_6_bn/moving_mean", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_6_bn/moving_variance", "dtype": "float32"}, {"shape": [1, 1, 512, 512], "name": "conv_pw_7/kernel", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_7_bn/gamma", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_7_bn/beta", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_7_bn/moving_mean", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_7_bn/moving_variance", "dtype": "float32"}, {"shape": [1, 1, 512, 512], "name": "conv_pw_8/kernel", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_8_bn/gamma", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_8_bn/beta", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_8_bn/moving_mean", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_8_bn/moving_variance", "dtype": "float32"}, {"shape": [1, 1, 512, 512], "name": "conv_pw_9/kernel", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_9_bn/gamma", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_9_bn/beta", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_9_bn/moving_mean", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_9_bn/moving_variance", "dtype": "float32"}], "paths": ["group1-shard1of7", "group1-shard2of7", "group1-shard3of7", "group1-shard4of7", "group1-shard5of7", "group1-shard6of7", "group1-shard7of7"]}], "modelTopology": {"keras_version": "2.1.4", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "mobilenet_1.00_96", "input_layers": [["input_1", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"name": "input_1", "batch_input_shape": [null, 96, 96, 3], "dtype": "float32", "sparse": false}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv1", "config": {"name": "conv1", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_regularizer": null, "data_format": "channels_last", "activation": "linear", "use_bias": false, "filters": 32, "bias_regularizer": null, "kernel_constraint": null, "strides": [2, 2], "trainable": true, "padding": "same", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv1_bn", "config": {"name": "conv1_bn", "gamma_constraint": null, "center": true, "beta_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1}, "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv1_relu", "config": {"name": "conv1_relu", "activation": "relu6", "trainable": true}, "inbound_nodes": [[["conv1_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "name": "conv_dw_1", "config": {"name": "conv_dw_1", "depthwise_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "depthwise_constraint": null, "data_format": "channels_last", "activation": "linear", "use_bias": false, "strides": [1, 1], "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "padding": "same", "depth_multiplier": 1, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv1_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv_dw_1_bn", "config": {"name": "conv_dw_1_bn", "gamma_constraint": null, "center": true, "beta_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1}, "inbound_nodes": [[["conv_dw_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv_dw_1_relu", "config": {"name": "conv_dw_1_relu", "activation": "relu6", "trainable": true}, "inbound_nodes": [[["conv_dw_1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv_pw_1", "config": {"name": "conv_pw_1", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_regularizer": null, "data_format": "channels_last", "activation": "linear", "use_bias": false, "filters": 64, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "trainable": true, "padding": "same", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}, "inbound_nodes": [[["conv_dw_1_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv_pw_1_bn", "config": {"name": "conv_pw_1_bn", "gamma_constraint": null, "center": true, "beta_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1}, "inbound_nodes": [[["conv_pw_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv_pw_1_relu", "config": {"name": "conv_pw_1_relu", "activation": "relu6", "trainable": true}, "inbound_nodes": [[["conv_pw_1_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "name": "conv_dw_2", "config": {"name": "conv_dw_2", "depthwise_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "depthwise_constraint": null, "data_format": "channels_last", "activation": "linear", "use_bias": false, "strides": [2, 2], "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "padding": "same", "depth_multiplier": 1, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv_pw_1_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv_dw_2_bn", "config": {"name": "conv_dw_2_bn", "gamma_constraint": null, "center": true, "beta_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1}, "inbound_nodes": [[["conv_dw_2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv_dw_2_relu", "config": {"name": "conv_dw_2_relu", "activation": "relu6", "trainable": true}, "inbound_nodes": [[["conv_dw_2_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv_pw_2", "config": {"name": "conv_pw_2", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_regularizer": null, "data_format": "channels_last", "activation": "linear", "use_bias": false, "filters": 128, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "trainable": true, "padding": "same", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}, "inbound_nodes": [[["conv_dw_2_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv_pw_2_bn", "config": {"name": "conv_pw_2_bn", "gamma_constraint": null, "center": true, "beta_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1}, "inbound_nodes": [[["conv_pw_2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv_pw_2_relu", "config": {"name": "conv_pw_2_relu", "activation": "relu6", "trainable": true}, "inbound_nodes": [[["conv_pw_2_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "name": "conv_dw_3", "config": {"name": "conv_dw_3", "depthwise_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "depthwise_constraint": null, "data_format": "channels_last", "activation": "linear", "use_bias": false, "strides": [1, 1], "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "padding": "same", "depth_multiplier": 1, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv_pw_2_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv_dw_3_bn", "config": {"name": "conv_dw_3_bn", "gamma_constraint": null, "center": true, "beta_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1}, "inbound_nodes": [[["conv_dw_3", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv_dw_3_relu", "config": {"name": "conv_dw_3_relu", "activation": "relu6", "trainable": true}, "inbound_nodes": [[["conv_dw_3_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv_pw_3", "config": {"name": "conv_pw_3", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_regularizer": null, "data_format": "channels_last", "activation": "linear", "use_bias": false, "filters": 128, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "trainable": true, "padding": "same", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}, "inbound_nodes": [[["conv_dw_3_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv_pw_3_bn", "config": {"name": "conv_pw_3_bn", "gamma_constraint": null, "center": true, "beta_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1}, "inbound_nodes": [[["conv_pw_3", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv_pw_3_relu", "config": {"name": "conv_pw_3_relu", "activation": "relu6", "trainable": true}, "inbound_nodes": [[["conv_pw_3_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "name": "conv_dw_4", "config": {"name": "conv_dw_4", "depthwise_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "depthwise_constraint": null, "data_format": "channels_last", "activation": "linear", "use_bias": false, "strides": [2, 2], "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "padding": "same", "depth_multiplier": 1, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv_pw_3_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv_dw_4_bn", "config": {"name": "conv_dw_4_bn", "gamma_constraint": null, "center": true, "beta_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1}, "inbound_nodes": [[["conv_dw_4", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv_dw_4_relu", "config": {"name": "conv_dw_4_relu", "activation": "relu6", "trainable": true}, "inbound_nodes": [[["conv_dw_4_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv_pw_4", "config": {"name": "conv_pw_4", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_regularizer": null, "data_format": "channels_last", "activation": "linear", "use_bias": false, "filters": 256, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "trainable": true, "padding": "same", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}, "inbound_nodes": [[["conv_dw_4_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv_pw_4_bn", "config": {"name": "conv_pw_4_bn", "gamma_constraint": null, "center": true, "beta_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1}, "inbound_nodes": [[["conv_pw_4", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv_pw_4_relu", "config": {"name": "conv_pw_4_relu", "activation": "relu6", "trainable": true}, "inbound_nodes": [[["conv_pw_4_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "name": "conv_dw_5", "config": {"name": "conv_dw_5", "depthwise_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "depthwise_constraint": null, "data_format": "channels_last", "activation": "linear", "use_bias": false, "strides": [1, 1], "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "padding": "same", "depth_multiplier": 1, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv_pw_4_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv_dw_5_bn", "config": {"name": "conv_dw_5_bn", "gamma_constraint": null, "center": true, "beta_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1}, "inbound_nodes": [[["conv_dw_5", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv_dw_5_relu", "config": {"name": "conv_dw_5_relu", "activation": "relu6", "trainable": true}, "inbound_nodes": [[["conv_dw_5_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv_pw_5", "config": {"name": "conv_pw_5", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_regularizer": null, "data_format": "channels_last", "activation": "linear", "use_bias": false, "filters": 256, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "trainable": true, "padding": "same", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}, "inbound_nodes": [[["conv_dw_5_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv_pw_5_bn", "config": {"name": "conv_pw_5_bn", "gamma_constraint": null, "center": true, "beta_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1}, "inbound_nodes": [[["conv_pw_5", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv_pw_5_relu", "config": {"name": "conv_pw_5_relu", "activation": "relu6", "trainable": true}, "inbound_nodes": [[["conv_pw_5_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "name": "conv_dw_6", "config": {"name": "conv_dw_6", "depthwise_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "depthwise_constraint": null, "data_format": "channels_last", "activation": "linear", "use_bias": false, "strides": [2, 2], "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "padding": "same", "depth_multiplier": 1, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv_pw_5_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv_dw_6_bn", "config": {"name": "conv_dw_6_bn", "gamma_constraint": null, "center": true, "beta_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1}, "inbound_nodes": [[["conv_dw_6", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv_dw_6_relu", "config": {"name": "conv_dw_6_relu", "activation": "relu6", "trainable": true}, "inbound_nodes": [[["conv_dw_6_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv_pw_6", "config": {"name": "conv_pw_6", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_regularizer": null, "data_format": "channels_last", "activation": "linear", "use_bias": false, "filters": 512, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "trainable": true, "padding": "same", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}, "inbound_nodes": [[["conv_dw_6_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv_pw_6_bn", "config": {"name": "conv_pw_6_bn", "gamma_constraint": null, "center": true, "beta_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1}, "inbound_nodes": [[["conv_pw_6", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv_pw_6_relu", "config": {"name": "conv_pw_6_relu", "activation": "relu6", "trainable": true}, "inbound_nodes": [[["conv_pw_6_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "name": "conv_dw_7", "config": {"name": "conv_dw_7", "depthwise_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "depthwise_constraint": null, "data_format": "channels_last", "activation": "linear", "use_bias": false, "strides": [1, 1], "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "padding": "same", "depth_multiplier": 1, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv_pw_6_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv_dw_7_bn", "config": {"name": "conv_dw_7_bn", "gamma_constraint": null, "center": true, "beta_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1}, "inbound_nodes": [[["conv_dw_7", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv_dw_7_relu", "config": {"name": "conv_dw_7_relu", "activation": "relu6", "trainable": true}, "inbound_nodes": [[["conv_dw_7_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv_pw_7", "config": {"name": "conv_pw_7", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_regularizer": null, "data_format": "channels_last", "activation": "linear", "use_bias": false, "filters": 512, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "trainable": true, "padding": "same", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}, "inbound_nodes": [[["conv_dw_7_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv_pw_7_bn", "config": {"name": "conv_pw_7_bn", "gamma_constraint": null, "center": true, "beta_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1}, "inbound_nodes": [[["conv_pw_7", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv_pw_7_relu", "config": {"name": "conv_pw_7_relu", "activation": "relu6", "trainable": true}, "inbound_nodes": [[["conv_pw_7_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "name": "conv_dw_8", "config": {"name": "conv_dw_8", "depthwise_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "depthwise_constraint": null, "data_format": "channels_last", "activation": "linear", "use_bias": false, "strides": [1, 1], "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "padding": "same", "depth_multiplier": 1, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv_pw_7_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv_dw_8_bn", "config": {"name": "conv_dw_8_bn", "gamma_constraint": null, "center": true, "beta_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1}, "inbound_nodes": [[["conv_dw_8", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv_dw_8_relu", "config": {"name": "conv_dw_8_relu", "activation": "relu6", "trainable": true}, "inbound_nodes": [[["conv_dw_8_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv_pw_8", "config": {"name": "conv_pw_8", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_regularizer": null, "data_format": "channels_last", "activation": "linear", "use_bias": false, "filters": 512, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "trainable": true, "padding": "same", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}, "inbound_nodes": [[["conv_dw_8_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv_pw_8_bn", "config": {"name": "conv_pw_8_bn", "gamma_constraint": null, "center": true, "beta_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1}, "inbound_nodes": [[["conv_pw_8", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv_pw_8_relu", "config": {"name": "conv_pw_8_relu", "activation": "relu6", "trainable": true}, "inbound_nodes": [[["conv_pw_8_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "name": "conv_dw_9", "config": {"name": "conv_dw_9", "depthwise_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "depthwise_constraint": null, "data_format": "channels_last", "activation": "linear", "use_bias": false, "strides": [1, 1], "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "padding": "same", "depth_multiplier": 1, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv_pw_8_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv_dw_9_bn", "config": {"name": "conv_dw_9_bn", "gamma_constraint": null, "center": true, "beta_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1}, "inbound_nodes": [[["conv_dw_9", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv_dw_9_relu", "config": {"name": "conv_dw_9_relu", "activation": "relu6", "trainable": true}, "inbound_nodes": [[["conv_dw_9_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv_pw_9", "config": {"name": "conv_pw_9", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_regularizer": null, "data_format": "channels_last", "activation": "linear", "use_bias": false, "filters": 512, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "trainable": true, "padding": "same", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}, "inbound_nodes": [[["conv_dw_9_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv_pw_9_bn", "config": {"name": "conv_pw_9_bn", "gamma_constraint": null, "center": true, "beta_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1}, "inbound_nodes": [[["conv_pw_9", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv_pw_9_relu", "config": {"name": "conv_pw_9_relu", "activation": "relu6", "trainable": true}, "inbound_nodes": [[["conv_pw_9_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "name": "conv_dw_10", "config": {"name": "conv_dw_10", "depthwise_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "depthwise_constraint": null, "data_format": "channels_last", "activation": "linear", "use_bias": false, "strides": [1, 1], "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "padding": "same", "depth_multiplier": 1, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv_pw_9_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv_dw_10_bn", "config": {"name": "conv_dw_10_bn", "gamma_constraint": null, "center": true, "beta_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1}, "inbound_nodes": [[["conv_dw_10", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv_dw_10_relu", "config": {"name": "conv_dw_10_relu", "activation": "relu6", "trainable": true}, "inbound_nodes": [[["conv_dw_10_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv_pw_10", "config": {"name": "conv_pw_10", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_regularizer": null, "data_format": "channels_last", "activation": "linear", "use_bias": false, "filters": 512, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "trainable": true, "padding": "same", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}, "inbound_nodes": [[["conv_dw_10_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv_pw_10_bn", "config": {"name": "conv_pw_10_bn", "gamma_constraint": null, "center": true, "beta_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1}, "inbound_nodes": [[["conv_pw_10", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv_pw_10_relu", "config": {"name": "conv_pw_10_relu", "activation": "relu6", "trainable": true}, "inbound_nodes": [[["conv_pw_10_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "name": "conv_dw_11", "config": {"name": "conv_dw_11", "depthwise_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "depthwise_constraint": null, "data_format": "channels_last", "activation": "linear", "use_bias": false, "strides": [1, 1], "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "padding": "same", "depth_multiplier": 1, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv_pw_10_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv_dw_11_bn", "config": {"name": "conv_dw_11_bn", "gamma_constraint": null, "center": true, "beta_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1}, "inbound_nodes": [[["conv_dw_11", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv_dw_11_relu", "config": {"name": "conv_dw_11_relu", "activation": "relu6", "trainable": true}, "inbound_nodes": [[["conv_dw_11_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv_pw_11", "config": {"name": "conv_pw_11", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_regularizer": null, "data_format": "channels_last", "activation": "linear", "use_bias": false, "filters": 512, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "trainable": true, "padding": "same", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}, "inbound_nodes": [[["conv_dw_11_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv_pw_11_bn", "config": {"name": "conv_pw_11_bn", "gamma_constraint": null, "center": true, "beta_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1}, "inbound_nodes": [[["conv_pw_11", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv_pw_11_relu", "config": {"name": "conv_pw_11_relu", "activation": "relu6", "trainable": true}, "inbound_nodes": [[["conv_pw_11_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "name": "conv_dw_12", "config": {"name": "conv_dw_12", "depthwise_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "depthwise_constraint": null, "data_format": "channels_last", "activation": "linear", "use_bias": false, "strides": [2, 2], "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "padding": "same", "depth_multiplier": 1, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv_pw_11_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv_dw_12_bn", "config": {"name": "conv_dw_12_bn", "gamma_constraint": null, "center": true, "beta_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1}, "inbound_nodes": [[["conv_dw_12", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv_dw_12_relu", "config": {"name": "conv_dw_12_relu", "activation": "relu6", "trainable": true}, "inbound_nodes": [[["conv_dw_12_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv_pw_12", "config": {"name": "conv_pw_12", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_regularizer": null, "data_format": "channels_last", "activation": "linear", "use_bias": false, "filters": 1024, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "trainable": true, "padding": "same", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}, "inbound_nodes": [[["conv_dw_12_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv_pw_12_bn", "config": {"name": "conv_pw_12_bn", "gamma_constraint": null, "center": true, "beta_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1}, "inbound_nodes": [[["conv_pw_12", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv_pw_12_relu", "config": {"name": "conv_pw_12_relu", "activation": "relu6", "trainable": true}, "inbound_nodes": [[["conv_pw_12_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "name": "conv_dw_13", "config": {"name": "conv_dw_13", "depthwise_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "depthwise_constraint": null, "data_format": "channels_last", "activation": "linear", "use_bias": false, "strides": [1, 1], "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "padding": "same", "depth_multiplier": 1, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv_pw_12_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv_dw_13_bn", "config": {"name": "conv_dw_13_bn", "gamma_constraint": null, "center": true, "beta_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1}, "inbound_nodes": [[["conv_dw_13", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv_dw_13_relu", "config": {"name": "conv_dw_13_relu", "activation": "relu6", "trainable": true}, "inbound_nodes": [[["conv_dw_13_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv_pw_13", "config": {"name": "conv_pw_13", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_regularizer": null, "data_format": "channels_last", "activation": "linear", "use_bias": false, "filters": 1024, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "trainable": true, "padding": "same", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}, "inbound_nodes": [[["conv_dw_13_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv_pw_13_bn", "config": {"name": "conv_pw_13_bn", "gamma_constraint": null, "center": true, "beta_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "axis": -1}, "inbound_nodes": [[["conv_pw_13", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv_pw_13_relu", 